Tekla Open API Reference for Tekla Structures 2025
BaseComponent.ClassFromAttributeFile Field
 A constant integer defining that the class is to be read from the attribute file. The class must be set to this constant value before inserting the component.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const int ClassFromAttributeFile = -100
Public Const ClassFromAttributeFile As Integer = -100
Field Value
Type: Int32
See Also
Reference
BaseComponent Class
Tekla.Structures.Model Namespace